Ansible/Auto Hardware RMA/tasks/templates/Dell_GET_Hardare_part_number_by_ServiceTag.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:api="http://api.dell.com">
   <soapenv:Header/>
   <soapenv:Body>
      <api:GetPartsbyServiceTag>
         <api:GetPartsbyServiceTag>
            <tem:Login>{{ login_email }}</tem:Login>
            <tem:Password>{{ login_password }}</tem:Password>
           <api:ServiceTag>{{ database_return['item'][serialtag].name }}</api:ServiceTag>
         </api:GetPartsbyServiceTag>
      </api:GetPartsbyServiceTag>
   </soapenv:Body>
</soapenv:Envelope>